{
  "personal": {
    "name": "Gonzalo",
    "title": "Desarrollador y Diseñador Web",
    "location": "España",
    "tagline": "Creando experiencias web modernas con Astro, Vue y un diseño minimalista",
    "email": "me@azaldev.com",
    "social": {
      "linkedin": "https://lalo.lol/in",
      "github": "https://lalo.lol/gh",
      "malt": "https://lalo.lol/malt"
    }
  },
  "navigation": [
    { "label": "Sobre mí", "target": "about" },
    { "label": "Trabajos", "target": "work" },
    { "label": "Experiencia", "target": "experience" },
    { "label": "Contacto", "target": "contact" }
  ],
  "about": {
    "title": "Sobre mí",
    "paragraphs": [
      "Soy un desarrollador frontend de España, especializado en crear experiencias web modernas y eficientes. Con mi experiencia en Desarrollo de Aplicaciones Web y Multiplataforma, combino un conocimiento técnico muy sólido con un enfoque estético minimalista.",
      "Mi pasión por la automatización y el código limpio me permite entregar soluciones que no solo se ven increíbles, sino que funcionan a la perfección. Me centro en crear experiencias digitales que sean, a la vez, bonitas y funcionales."
    ],
    "technologies": [
      "Astro",
      "Vue.js",
      "TailwindCSS",
      "React",
      "JavaScript",
      "GitHub"
    ]
  },
  "work": {
    "title": "Trabajos destacados",
    "projects": [
      {
        "title": "Plataforma Hearinit",
        "year": "2025",
        "description": "Una plataforma supermoderna que conecta a usuarios con audiólogos certificados y centros auditivos de confianza. Diseño accesible, centrado en ofrecer asesoramiento personalizado, acceso a expertos y soporte continuo.",
        "technologies": "Astro, TailwindCSS, CMS Integration",
        "longDescription": "Hearinit es una plataforma moderna diseñada para conectar de manera fluida a las personas con audiólogos certificados y centros auditivos de confianza. Su misión principal es ofrecer una experiencia accesible e intuitiva, asegurando que cada usuario reciba una orientación personalizada para su salud auditiva. La plataforma destaca por su accesibilidad universal, permitiendo que cualquiera pueda navegar sin esfuerzo mientras accede a recomendaciones hechas a su medida.",
        "features": [
          "Diseño responsivo para todo tipo de dispositivos",
          "Navegación intuitiva y arquitectura de información clara",
          "Formularios interactivos para contacto y solicitud de citas",
          "Rendimiento optimizado para tiempos de carga rápidos",
          "Integración de mapas para localizar centros asociados",
          "Optimización SEO para mayor visibilidad en buscadores",
          "Marca visual profesional y de confianza"
        ],
        "liveUrl": "https://hearinit.com",
        "githubUrl": ""
      },
      {
        "title": "Paquete NPM",
        "year": "2025",
        "description": "Una herramienta CLI que configura proyectos frontend modernos con Vue + Tailwind o Astro + Tailwind en un abrir y cerrar de ojos.",
        "technologies": "Astro, TailwindCSS, Node",
        "longDescription": "Diseñé y desarrollé un panel de control de analíticas interactivo para visualizar métricas de negocio clave. El frontend se construyó con Astro para un rendimiento óptimo y SEO, mientras que el procesamiento de datos y la automatización de informes se gestionaron con scripts de Python. Usé Chart.js para visualizaciones de datos dinámicas y personalizables, ofreciendo insights súper útiles para los directivos. El panel está diseñado para integrarse fácilmente con diversas fuentes de datos.",
        "features": [
          "Creación de proyectos con integración de Astro y Tailwind CSS",
          "Estructura con diseño responsivo de serie",
          "Estructura de archivos minimalista y cuidada",
          "Fácil de empezar con el comando 'npx create-azaldev-template'",
          "Scripts de desarrollo y compilación listos para usar",
          "Integración perfecta con GitHub para el control de versiones",
          "Plantillas modernas y accesibles",
          "Incluye documentación pensada para desarrolladores"
        ],
        "liveUrl": "https://docs-azaldev-template.azaldev.com/",
        "githubUrl": "https://www.npmjs.com/package/create-azaldev-template"
      },
      {
        "title": "Bite & Smash",
        "year": "2025",
        "description": "Diseñé y desarrollé la web de Bite & Smash para mostrar su carta y destacar su concepto único de hamburguesas.",
        "technologies": "Astro, TailwindCSS, UI/UX",
        "longDescription": "Diseñé y desarrollé la web para Bite & Smash, una hamburguesería moderna, poniendo un énfasis especial en destacar su menú y su identidad culinaria única. La web se creó para reflejar la personalidad atrevida de la marca, usando imágenes vibrantes y un diseño limpio para destacar los platos estrella, los ingredientes y el concepto de cocina 'smash'. El resultado es una presencia digital atractiva que eleva su marca y mejora la experiencia del cliente en la web.",
        "features": [
          "Animaciones fluidas y de alto rendimiento (GSAP)",
          "Carga de imágenes y recursos optimizada",
          "Diseño totalmente responsivo y accesible",
          "Formulario de contacto integrado",
          "Sección de blog para novedades del estudio"
        ],
        "liveUrl": "https://bite-and-smash.tunuevaweb.es/",
        "githubUrl": "https://github.com/tunuevaweb/bite-and-smash"
      },
      {
        "title": "Tu Nueva Web",
        "year": "2024",
        "description": "'Tu Nueva Web' crea sitios web modernos, accesibles y optimizados para ayudar a personas y negocios a construir una presencia online fuerte y rápida.",
        "technologies": "Astro, TailwindCSS, SEO",
        "longDescription": "Tu Nueva Web se especializa en crear soluciones web modernas, accesibles y optimizadas para el rendimiento, pensadas para las necesidades de personas y empresas. Nos centramos en la usabilidad y el diseño para ayudar a los clientes a establecer una presencia online profesional y efectiva, de forma rápida y sin complicaciones innecesarias. Ya sea para una marca personal o una empresa en crecimiento, nuestras webs están diseñadas para ser rápidas, adaptables y fáciles de gestionar desde el primer día.",
        "features": [
          "Entrada y procesamiento de datos automatizados",
          "Programación de tareas personalizable",
          "Interfaz web para una interacción sencilla",
          "Registro e informes de errores",
          "Integración con APIs de terceros"
        ],
        "liveUrl": "https://tunuevaweb.es",
        "githubUrl": ""
      }
    ]
  },
  "experience": {
    "title": "Experiencia",
    "positions": [
      {
        "title": "Desarrollador Freelance",
        "company": "Autónomo",
        "period": "2024 - Hoy",
        "description": "Desarrollo de sitios web y aplicaciones para clientes diversos. Especializado en frameworks modernos y diseño minimalista, con un gran foco en el rendimiento y la experiencia de usuario.",
        "technologies": "Vue.js, Astro, TailwindCSS, Jamstack"
      },
      {
        "title": "Desarrollador de Sistemas",
        "company": "Accenture",
        "period": "2023 - 2024",
        "description": "Desarrollo de mejoras y automatizaciones en aplicaciones internas usando Python y VB.NET. Optimización de procesos e implementación de soluciones super eficientes.",
        "technologies": "Python, VB.NET, Automatización de procesos"
      }
    ]
  },
  "philosophy": {
    "title": "Mi Filosofía",
    "values": [
      {
        "title": "Claridad",
        "tagline": "Código transparente, comunicación directa.",
        "description": "Creo firmemente en construir soluciones con total claridad, desde la primera línea de código hasta el despliegue final. Esto significa escribir código limpio y bien documentado que sea fácil de entender y mantener. Igual de importante es la comunicación transparente y constante con los clientes, asegurándome de que todos estemos en sintonía e informados en cada etapa del proyecto."
      },
      {
        "title": "Eficiencia",
        "tagline": "Soluciones optimizadas, máximo impacto.",
        "description": "La eficiencia es el corazón de mi proceso de desarrollo. Me esfuerzo por ofrecer soluciones optimizadas que no solo funcionen de forma impecable, sino que también sean escalables y fáciles de mantener a largo plazo. Esto implica elegir las herramientas adecuadas, agilizar los flujos de trabajo y automatizar tareas repetitivas para conseguir el máximo impacto con el mínimo esfuerzo."
      },
      {
        "title": "Diseño con propósito",
        "tagline": "Estética con una misión.",
        "description": "El diseño no es solo cómo se ve algo, sino cómo funciona. Mi enfoque de diseño es intencional, asegurándome de que cada elemento visual e interacción tenga una función clara. Creo una estética que mejora la usabilidad y eleva la experiencia de usuario, creando productos digitales que son a la vez bonitos y funcionales de forma intuitiva."
      }
    ]
  },
  "contact": {
    "title": "Contacto",
    "message": "Estoy disponible para nuevos proyectos freelance. Hablemos de cómo podemos hacer realidad tus ideas.",
    "footer": "Entre líneas de código, la humanidad permanece."
  }
}
